#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil prop:nil
#+OPTIONS: stat:t tags:t tasks:t tex:t timestamp:t toc:t todo:t |:t
#+TITLE: demos
#+DATE: <2014-08-26 Tue>
#+AUTHOR: Charles Berry
#+EMAIL: ccberry@ucsd.edu
#+DESCRIPTION: demonstrate/test ravel capabilities
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.3.1 (Org mode 8.3beta)


* expanded document


 #+NAME: stuff
#+HEADER: :exports code
#+BEGIN_SRC org

  @@latex:\section{@@ The Letter src_R{i} @@latex:}@@

  The letter src_R{i} 
  - can be upcased like this: src_R{toupper(i)}
  - its character codes is src_R{charToRaw(i)} 
  - src_R{toupper(i)}'s character code is src_R{charToRaw(toupper(i))}.


#+END_SRC

#+NAME: excode
#+BEGIN_SRC emacs-lisp :var code=stuff :exports code :wrap latex
  (org-ravel-export-string-as code 'ravel-latex 
                              t nil nil "braces")
#+END_SRC

#+RESULTS: excode
#+BEGIN_latex
\section{ The Letter {{i}} }

The letter {{i}} can be upcased like this: {{toupper(i)}}.
The character codes are {{charToRaw(i)}} and {{charToRaw(toupper(i))}}.
#+END_latex

#+HEADER: :var ktmp=excode
#+BEGIN_SRC R :results output :wrap latex
  require(knitr)
  for (i in letters[1:5]){
      res <- knit_expand(text=ktmp)
      cat(res)
  }

#+END_SRC

#+RESULTS:
#+BEGIN_latex
\section{ The Letter a }

The letter a 
\begin{itemize}
\item can be upcased like this: A
\item its character codes is 61
\item A's character code is 41.
\end{itemize}
\section{ The Letter b }

The letter b 
\begin{itemize}
\item can be upcased like this: B
\item its character codes is 62
\item B's character code is 42.
\end{itemize}
\section{ The Letter c }

The letter c 
\begin{itemize}
\item can be upcased like this: C
\item its character codes is 63
\item C's character code is 43.
\end{itemize}
\section{ The Letter d }

The letter d 
\begin{itemize}
\item can be upcased like this: D
\item its character codes is 64
\item D's character code is 44.
\end{itemize}
\section{ The Letter e }

The letter e 
\begin{itemize}
\item can be upcased like this: E
\item its character codes is 65
\item E's character code is 45.
\end{itemize}
#+END_latex


** expected result						   :noexport:

   The file =captioned-src-block.Rnw= should contain code that this
   src block will turn into a pdf with a nicely captioned figure.

#+NAME: run-knitr-with-latex-caption
#+BEGIN_SRC R :results value
require(knitr)
knit2pdf("captioned-src-block.Rnw")
#+END_SRC

#+RESULTS: run-knitr-with-latex-caption
: captioned-src-block.pdf



** expected result						   :noexport:

   The file =captioned-src-block.Rnw= should contain code that this
   src block will turn into a pdf with a nicely captioned figure.

#+NAME: run-knitr-with-tricky-latex-caption
#+BEGIN_SRC R :results value
require(knitr)
knit2pdf("captioned-src-block.Rnw")
#+END_SRC

#+RESULTS: run-knitr-with-tricky-latex-caption
: captioned-src-block.pdf

